# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs
# Plan 11v: DCNv3 deformable backbone + AKConv neck + AIoU loss

# Parameters
nc: 6
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11n backbone with DCNv3 deformable convolution
backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C2fDCNv3, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C2fDCNv3, [1024, True]]
  - [-1, 1, AIFI, [512, 8]]
  - [-1, 1, Conv, [1024, 3, 1]]
  - [-1, 2, C2fDCNv3, [1024]]

# YOLO11n head with AKConv (3-scale P3-P5)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C2fAKConv, [512, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C2fAKConv, [256, False]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, C2fAKConv, [256, False]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, C2fAKConv, [512, True]]

  - [[17, 20, 23], 1, Detect, [nc]]